# WEB SCRAPING – ASSIGNMENT2

In [ ]:
#installing selenium
#!pip install selenium

In [27]:
#importing all required libraries
import selenium
from selenium import webdriver
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

In [28]:
#connecting to the web driver
driver=webdriver.Chrome(r'C:\Users\91845\chromedriver.exe')

# QUESTION 1

1.we will scrape data from https://www.naukri.com/website for Data Analyst position for Bnagalore location.We will scrape 4 firlds for each job as mentioned below:
 1)Job title 2)Job location 3)company_name 4)Experience required

In [116]:
# getting the naukri portal url on the web driver
url='https://www.naukri.com/'
driver.get(url)

In [117]:
#code for finding Data Analyst on search job bar using id
search_job=driver.find_element_by_class_name("suggestor-input")
search_job.send_keys("Data Analyst")

In [5]:
#code for finading Bangalore on search locn bar using absolute xpath
search_locn =driver.find_element_by_xpath('/html/body/div/div[2]/div[3]/div/div/div[3]/div/div/div/input')
search_locn.send_keys("Bangalore")

In [6]:
#code for clicking button using absolute xpath function
search_btn=driver.find_element_by_xpath('/html/body/div/div[2]/div[3]/div/div/div[6]')
search_btn.click()

In [7]:
# extract all the job titles
title_tags=driver.find_elements_by_xpath('//a[@class="title fw500 ellipsis"]')
job_titles=[]
for i in title_tags[:10]:
    job_titles.append(i.text)
    
# extract all the location
locn_tags=driver.find_elements_by_xpath('//li[@class="fleft grey-text br2 placeHolderLi location"]')
Location=[]
for i in locn_tags[:10]:
    Location.append(i.text)
    
#extracting all company names
company_tags=driver.find_elements_by_xpath('//a[@class="subTitle ellipsis fleft"]')  
company_names=[]

for i in company_tags[:10]:
    company_names.append(i.text)
    
#extarcting all the experience    
exp_tags=driver.find_elements_by_xpath('//li[@class="fleft grey-text br2 placeHolderLi experience"]/span')
experience=[]
for i in exp_tags[:10]:
    experience.append(i.text) 
    
#checking the length     
len(job_titles),len(company_names),len(experience),len(Location)    

# creating the dataframe now
jobs=pd.DataFrame()
jobs['Job Titles']=job_titles
jobs['Company']=company_names
jobs['Experience']=experience
jobs['Location']=Location
jobs

,Job Titles,Company,Experience,Location
0,Hiring Data analyst with Pharma Background acr...,HCL,6-11 Yrs,"Hyderabad/Secunderabad, Chennai, Bangalore/Ben..."
1,Data Coordinator | Data Analyst | MS Excel | T...,Inspiration Manpower Consultancy Pvt. Ltd.,0-4 Yrs,Bangalore/Bengaluru(Sadashiva Nagar)
2,software developer & Testing / Business Analys...,SECRET TECHNOLOGIES INDIA VMS GROUP,5-7 Yrs,"Pune, Bangalore/Bengaluru(Shivaji Nagar), Mumb..."
3,Staff Business Data Analyst - FDP,Intuit Inc.,4-9 Yrs,Bangalore/Bengaluru
4,Data Analyst - IIM/ISB/MDI/FMS/SP Jain,K12 Techno Services Pvt Ltd,4-8 Yrs,Bangalore/Bengaluru
5,Senior Data Analyst,Capco,3-6 Yrs,Bangalore/Bengaluru
6,Senior Data Analyst,Mobile Premier League,3-6 Yrs,Bangalore/Bengaluru
7,Senior Data Analyst,Flipkart,3-8 Yrs,Bangalore/Bengaluru
8,Hiring For Data Analyst!!!,Ignitho,2-7 Yrs,"Chennai, Bangalore/Bengaluru\n(WFH during Covid)"
9,Data Analyst,SunEdison,0-2 Yrs,"Bangalore/Bengaluru, Mumbai (All Areas)"

# QUESTION :2

   To scrape data for “Data Scientist” Job position in “Bangalore” locationfrom https://www.naukri.com/website. 
   We will scrape 3 fields for each job as mentioned : 1)Job title 2)Job location 3)company_name

In [8]:
url='https://www.naukri.com/'
driver.get(url)

In [9]:
#searching Data Scientist on search bar
search_job=driver.find_element_by_class_name("suggestor-input")
search_job.send_keys("Data Scientist")

In [10]:
#getting location on search bar using absolute xpath
search_locn =driver.find_element_by_xpath('/html/body/div/div[2]/div[3]/div/div/div[3]/div/div/div/input')
search_locn.send_keys("Bangalore")

In [11]:
#code for click button using absolute xpath function
search_btn=driver.find_element_by_xpath('/html/body/div/div[2]/div[3]/div/div/div[6]')
search_btn.click()

In [12]:
#extract all job titles
title_tags=driver.find_elements_by_xpath('//a[@class="title fw500 ellipsis"]')
job_titles=[]

for i in title_tags:
    job_titles.append(i.text)
    
#extract all company names
company_tags=driver.find_elements_by_xpath('//a[@class="subTitle ellipsis fleft"]')  
company_names=[]
for i in company_tags:
    company_names.append(i.text)


#extract all job location
locn_tags=driver.find_elements_by_xpath('//li[@class="fleft grey-text br2 placeHolderLi location"]')
Location=[]
for i in locn_tags:
    Location.append(i.text)
    
#checking the length
len(job_titles),len(company_names),len(Location)

#creating dataframe
jobs1=pd.DataFrame()
jobs1['Job Titles']=job_titles
jobs1['Location']=Location
jobs1['Company']=company_names
jobs1[:10]

,Job Titles,Location,Company
0,Data Scientist,"Pune, Gurgaon/Gurugram, Chennai, Bangalore/Ben...",HDFC Bank
1,Data Scientist,Bangalore/Bengaluru,Shell
2,Senior/ Lead Data Scientist,Bangalore/Bengaluru,AmoliTalents
3,Data Scientist / Analyst,Bangalore/Bengaluru,open data fabric
4,Forecasting Analyst/ Data Scientist (US Client),"Gurgaon/Gurugram, Bangalore/Bengaluru\n(WFH du...",Concentrix
5,Hiring Data Scientist - Analytics,"Bangalore/Bengaluru, Mumbai (All Areas)",Firstsource Solutions Limited
6,Computer Vision Python Data Scientist,"Mumbai, Hyderabad/Secunderabad, Pune, Chennai,...",OceanOfWeb
7,"Excellent Opportunity For Freshers For AI/ML, ...","Noida, Kolkata, Hyderabad/Secunderabad, Pune, ...",NTT Data
8,Junior Data Scientist,Bangalore/Bengaluru,Titan
9,Data Scientist,"Hyderabad/Secunderabad, Pune, Bangalore/Bengaluru",Amazon

# QUESTION :3

 3.To scrape data for “Data Scientist” Job position from https://www.naukri.com/website by
   using location and salary filter.
   The location filter used is “Delhi/NCR”. The salary filter used is “3-6” lakhs 
   We will scrape 4 fields for each job as mentioned :
   1)Job title 2)Job location 3)company_name 4)Experience required

In [13]:
url='https://www.naukri.com/'
driver.get(url)

In [14]:
##code for finding Data Scientist on search job bar using id 
search_job=driver.find_element_by_class_name("suggestor-input")
search_job.send_keys("Data Scientist")

In [15]:
#code for clicking button using absolute xpath function
search_btn=driver.find_element_by_xpath('/html/body/div/div[2]/div[3]/div/div/div[6]')
search_btn.click()

In [16]:
#Using Location filter as 'DELHI/NCR'
Location_check=driver.find_element_by_xpath('/html/body/div[1]/div[3]/div[2]/section[1]/div[2]/div[3]/div[2]/div[3]/label/i')
Location_check.click()

In [17]:
# code to click on the salary filter for "3-6 Lakhs"
salary_check=driver.find_element_by_xpath('/html/body/div[1]/div[3]/div[2]/section[1]/div[2]/div[4]/div[2]/div[2]/label/i')
salary_check.click()

In [18]:
# extract all the job titles
title_tags=driver.find_elements_by_xpath('//a[@class="title fw500 ellipsis"]')
job_titles=[]

for i in title_tags[:10]:
    job_titles.append(i.text)
    
# extract all the location
locn_tags=driver.find_elements_by_xpath('//li[@class="fleft grey-text br2 placeHolderLi location"]')
Location=[]
  
for i in locn_tags[:10]:
    Location.append(i.text)
    
# extract all the company names
company_tags=driver.find_elements_by_xpath('//a[@class="subTitle ellipsis fleft"]') 
company_names=[]

for i in company_tags[:10]:
    company_names.append(i.text)
    
#extracting all the experience
exp_tags=driver.find_elements_by_xpath('//li[@class="fleft grey-text br2 placeHolderLi experience"]/span')  
experience=[]

for i in exp_tags[:10]:
    experience.append(i.text)

#checking length
len(job_titles),len(company_names),len(experience),len(Location)

jobs=pd.DataFrame()
jobs['Job Titles']=job_titles
jobs['Location']=Location
jobs['Company']=company_names
jobs['Experience']=experience
jobs

,Job Titles,Location,Company,Experience
0,"Excellent Opportunity For Freshers For AI/ML, ...","Noida, Kolkata, Hyderabad/Secunderabad, Pune, ...",NTT Data,0-0 Yrs
1,Data Analyst / Data Scientist / Business Analy...,"Noida, New Delhi, Delhi / NCR",GABA Consultancy services,0-0 Yrs
2,Data Scientist _NLP,"Bangalore/Bengaluru, Delhi / NCR\n(WFH during ...",EXL,3-8 Yrs
3,Junior Data Analyst/ Scientist- Fresher Position,"Kolkata, Hyderabad/Secunderabad, Pune, Ahmedab...",Sejal Consulting Hub,0-3 Yrs
4,Data Scientist - MIND Infotech,Noida,MOTHERSONSUMI INFOTECH & DESIGNS LIMITED,4-8 Yrs
5,Data Scientist - MIND Infotech,Noida,MOTHERSONSUMI INFOTECH & DESIGNS LIMITED,4-8 Yrs
6,Only Fresher / Python Data Scientist / Trainee...,"Noida, New Delhi, Gurgaon/Gurugram",GABA Consultancy services,0-0 Yrs
7,Lead Data Scientist,Delhi / NCR\n(WFH during Covid),Indihire HR Consultants Private Limited,2-4 Yrs
8,Urgent Requirement || Data Scientist || Noida,"Noida, Delhi / NCR",HCL,3-8 Yrs
9,Data Scientist,New Delhi,Boston Consulting Group,2-5 Yrs

# QUESTION 4:

4.We have to scrape data of first 100 sunglasses listings on flipkart.com.
We have to scrape four attributes:
1. Brand
2. Product Description
3. Price
4. Discount percentage

In [4]:
# getting the flipkart shopping site url on the web driver
url='https://www.flipkart.com/'
driver.get(url)

In [5]:
#code to write sunglasses in the search box
search_prod=driver.find_element_by_class_name("_3704LK")
search_prod.send_keys("sunglasses")

In [8]:
#code for clicking search button using absolute xpath function
search_btn=driver.find_element_by_xpath('//button[@class="L0Z3Pu"]')
search_btn.click()

In [13]:
#empty lists
brand=[]
prod_desc=[]
price=[]
discount=[]

#As we need to scrap for 100 products so we will take a for loop which will iterate 3 times since we need to collect data from 3 pages
 
for i in range(0,4):
    for j in driver.find_elements_by_xpath('//div[@class="_2WkVRV"]'):
        brand.append(j.text)
    for j in driver.find_elements_by_xpath("//a[@class='IRpwTa']"):
        prod_desc.append(j.text)
    for j in driver.find_elements_by_xpath('//div[@class="_30jeq3"]'):
        price.append(j.text)
    for j in driver.find_elements_by_xpath('//div[@class="_3Ay6Sb"]'):
        discount.append(j.text)
      
    #Path for next page inside same loop and appending numbers as pages change  
    k=i+1
    next_page="https://www.flipkart.com/search?q=sunglasses&otracker=search&otracker1=search&marketplace=FLIPKART&as-show=on&as=off&page="+str(k)
    driver.get(next_page)

In [14]:
#Checking the length of the data scraped
print(len(brand),len(prod_desc),len(price),len(discount))

160 160 160 160

In [15]:
# creating the data frame now
df = pd.DataFrame()
df['Product']=brand[:100]
df['Description']=prod_desc[:100]
df['Sunglasses Price']=price[:100]
df['Discount']=discount[:100]
df

,Product,Description,Sunglasses Price,Discount
0,GANSTA,UV Protection Aviator Sunglasses (57),₹234,88% off
1,SUNBEE,"UV Protection, Polarized, Mirrored Round Sungl...",₹234,86% off
2,IDEE,UV Protection Rectangular Sunglasses (59),₹929,62% off
3,Silver Kartz,UV Protection Clubmaster Sunglasses (53),₹317,78% off
4,SRPM,UV Protection Wayfarer Sunglasses (53),₹170,82% off
...,...,...,...,...
95,PIRASO,UV Protection Aviator Sunglasses (54),₹175,89% off
96,SRPM,"Night Vision, UV Protection Round Sunglasses (54)",₹149,85% off
97,SUNBEE,"UV Protection, Polarized, Mirrored Wayfarer Su...",₹203,84% off
98,IDEE,UV Protection Cat-eye Sunglasses (17),₹859,61% off
99,VINCENT CHASE,UV Protection Wayfarer Sunglasses (59),₹749,62% off

# QUESTION-5

we are required to scrape first 100 reviews including three attributes as below:
1.Rating
2.Review summary
3. Full review

In [16]:
# getting the flipkart shopping site url on the web driver
url = "https://www.flipkart.com/apple-iphone-11-black-64-gb-includes-earpods-power-adapter/product-reviews/itm0f37c2240b217?pid=MOBFKCTSVZAXUHGR&lid=LSTMOBFKCTSVZAXUHGREPBFGI&marketplace=FLIPKART"
driver.get(url)

In [17]:
url = driver.find_elements_by_xpath('//nav[@class="yFHi8N"]//a')

# extract all the job search links from the above search result
prod_urls=[]
for i in url[:11]:
    prod_urls.append(i.get_attribute('href'))

In [18]:
#empty lists
rating=[]
summary=[]
full_review=[]

#As there are 10 reviews per page so we will ierate for 10 times for the required data

for i in range(0,11):
    for j in driver.find_elements_by_xpath("//div[@class='_3LWZlK _1BLPMq']"):
        rating.append(j.text)
    for j in driver.find_elements_by_xpath("//p[@class='_2-N8zT']"):
        summary.append(j.text)
    for j in driver.find_elements_by_xpath("//div[@class='t-ZTKy']"):
        full_review.append(j.text)
        
    #Path for next page as it changes for every page 
    driver.find_element_by_xpath('/html/body/div/div/div[3]/div/div/div[2]/div[13]/div/div/nav/a[1]').click()

In [19]:
#Checking the length of the data scraped
print(len(rating),len(summary),len(full_review))

110 110 110

In [20]:
#Creating a new dataframe
df=pd.DataFrame()
df['Rating']=rating[:100]
df['Review']=summary[:100]
df['Full summary']=full_review[:100]
df

,Rating,Review,Full summary
0,5,Brilliant,The Best Phone for the Money\n\nThe iPhone 11 ...
1,5,Simply awesome,Really satisfied with the Product I received.....
2,5,Best in the market!,Great iPhone very snappy experience as apple k...
3,5,Perfect product!,Amazing phone with great cameras and better ba...
4,5,Fabulous!,This is my first iOS phone. I am very happy wi...
...,...,...,...
95,5,Worth every penny,Previously I was using one plus 3t it was a gr...
96,5,Great product,Amazing Powerful and Durable Gadget.\n\nI’m am...
97,4,Good choice,So far it’s been an AMAZING experience coming ...
98,5,Highly recommended,What a camera .....just awesome ..you can feel...
99,5,Worth every penny,"i11 is worthy to buy, too much happy with the ..."

# QUESTION:6

 Scraping data for first 100 sneakers from flipkart.com The follwing attributes of each sneaker has to be scrapped:
1.Brand
2.Product Description
3.Price
4.Discount

In [29]:
# getting the flipkart shopping site url on the web driver
url = "https://www.flipkart.com/"
driver.get(url)

In [31]:
#Searching sneakers in the search bar and clicking the search button
search_bar=driver.find_element_by_xpath("//input[@type='text']")
search_bar.send_keys('sneakers')

driver.find_element_by_xpath("//button[@type='submit']").click()

In [32]:
# empty lists
brand=[]
prod_desc=[]
price=[]
discount=[]

#Scraping for 100 products and considerering the data from first 3 pages while iterating for 3 times  
for i in range(0,5):
    for j in driver.find_elements_by_xpath("//div[@class='_2WkVRV']"):
        brand.append(j.text)
    for j in driver.find_elements_by_xpath("//a[@class='IRpwTa']"):
        prod_desc.append(j.text)
    for j in driver.find_elements_by_xpath("//div[@class='_3I9_wc']"):
        price.append(j.text)
    for j in driver.find_elements_by_xpath("//div[@class='_3Ay6Sb']/span"):
        discount.append(j.text)
        
   #Path for next page as it changes for every page 
    driver.find_element_by_xpath('/html/body/div/div/div[3]/div[1]/div[2]/div[12]/div/div/nav/a[1]').click()

In [33]:
# checking the length 
print("Lengths of columns:", len(brand), len(prod_desc), len(price), len(discount))

Lengths of columns: 200 165 200 200

In [34]:
# creating the data frame now
df = pd.DataFrame()
df[' Brand']=brand[:100]
df[' Description']=prod_desc[:100]
df[' Price']=price[:100]
df[' Discount']=discount[:100]
df

,Brand,Description,Price,Discount
0,Chevit,Super Stylish & Trendy Combo Pack of 02 Pairs ...,"₹1,598",68% off
1,Magnolia,Sneakers For Men,₹999,67% off
2,corsac,5011-Latest Collection Stylish Casual Loafer S...,"₹1,499",71% off
3,SHELBY,Modern Trendy Sneakers Shoes Sneakers For Men,"₹1,299",61% off
4,World Wear Footwear,Luxury Fashionable casual sneaker shoes Sneake...,₹499,70% off
...,...,...,...,...
95,Varito,Sneakers For Men,"₹2,199",79% off
96,DUNKASTON,Men's Sneakers Fashion Lightweight Running Sho...,"₹1,499",82% off
97,aadi,Luxury Fashionable casual sneaker shoes Sneake...,₹999,73% off
98,BRUTON,Sneakers For Men,"₹3,499",87% off
99,RapidBox,Super Stylish & Trendy Combo Pack of 02 Pairs ...,₹999,41% off

# QUESTION:7

Scrapping first 100 shoes data having filter as Set Price filter to “Rs. 7149 to Rs. 14099 ” , Color filter to “Black”.
Attributes to be scrapped are  “Brand” of the shoes , Short Shoe description, price of the shoe

In [46]:
# getting the myntra site for shoe scrapping url on the web driver
url = "https://www.myntra.com/shoes"
driver.get(url)

In [47]:
# Here we have to click two price filters for the required range first price filter "Rs. 7134 to Rs. 14089" 
price_filter1 = driver.find_element_by_xpath('/html/body/div[2]/div/div[1]/main/div[3]/div[1]/section/div/div[5]/ul/li[2]/label/div')
price_filter1.click()

In [48]:
#Second price filter from Rs 14089 to Rs.21044
price_filter2 = driver.find_element_by_xpath('/html/body/div[2]/div/div[1]/main/div[3]/div[1]/section/div/div[5]/ul/li[3]/label/div')
price_filter2.click()

In [49]:
# code to click on the color filter for "Black"
color_filter = driver.find_element_by_xpath('/html/body/div[2]/div/div[1]/main/div[3]/div[1]/section/div/div[6]/ul/li[1]/label/div')
color_filter.click()

In [53]:
#Taking the empty lists
brand=[]
short_desc=[]
price=[]

#We can see that there are 50 products in one page, and as we need to scrap for 100 products, we need to take 2 pages data
for i in range(0,2):
    #Finding the tags having the brand name
    for j in driver.find_elements_by_xpath("//h3[@class='product-brand']"):
        brand.append(j.text) 
    
    #Finding the tags having short description of the shoe
    for j in driver.find_elements_by_xpath("//h4[@class='product-product']"):
        short_desc.append(j.text) 
        
    #Finding the tags having the price of the shoe
    for j in driver.find_elements_by_xpath("//div[@class='product-price']"):
        price.append(j.text)  
        
    driver.find_element_by_xpath('/html/body/div[2]/div/div[1]/main/div[3]/div[2]/div/div[2]/section/div[2]/ul/li[12]/a').click()

In [54]:
# checking the length to get the data frame
print("Lengths of columns:", len(brand), len(short_desc), len(price))

Lengths of columns: 100 100 100

In [55]:
# creating the data frame now
df = pd.DataFrame()
df['Shoe Brand']=brand[:100]
df['Shoe Description']=short_desc[:100]
df['Shoe Price']=price[:100]
df

,Shoe Brand,Shoe Description,Shoe Price
0,ALDO,Men Leather Loafers,Rs. 15999
1,Nike,Men Winflo 7 Running Shoes,Rs. 7995
2,ALDO,Men Printed Sneakers,Rs. 9099Rs. 12999(30% OFF)
3,ALDO,Men Leather Driving Shoes,Rs. 12999
4,Puma,Electrify Nitro Running Shoes,Rs. 9999
...,...,...,...
95,Saint G,Leather High-Top Block Heeled Boots,Rs. 14025Rs. 16500(15% OFF)
96,Saint G,Leather Kitten Heeled Boots,Rs. 8415Rs. 9900(15% OFF)
97,DAVINCHI,Men Solid Leather Formal Derbys,Rs. 9990
98,Saint G,Printed Flatform Heeled Boots with Buckles,Rs. 8415Rs. 9900(15% OFF)
99,DAVINCHI,Men Textured Formal Leather Loafers,Rs. 8990

# QUESTION :8

Scraping first 10 laptops data using set filter as set CPU Type filter to “Intel Core i7” and “Intel Core i9” 
Scraping following attributes as :
1. Title
2. Ratings
3. Price

In [62]:
# getting the amazon shopping site url on the web driver
url = "https://www.amazon.in/"
driver.get(url)

In [63]:
# code to write laptop in the search box
search_prod = driver.find_element_by_xpath('//input[@id="twotabsearchtextbox"]')
search_prod.send_keys("Laptop")

# code to click on the search button
search_btn = driver.find_element_by_xpath('//input[@id="nav-search-submit-button"]')
search_btn.click()

In [ ]:
#code to click on the CPU filter for "Intel Core i7"
filter1 = driver.find_element_by_xpath('/html/body/div[1]/div[2]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[6]/ul[5]/li[11]/span/a/div/label/i')
filter1.click()

In [65]:
# code to click on the CPU filter for "Intel Core i9"
filter2 = driver.find_element_by_xpath('/html/body/div[1]/div[2]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[6]/ul[4]/li[14]/span/a/div/label/i')
filter2.click()

In [66]:
# code to extract laptop title
laptitle=[]
lap_title = driver.find_elements_by_xpath('//span[@class="a-size-medium a-color-base a-text-normal"]')
for i in lap_title[:10]:
    laptitle.append(i.text)

# code to extract laptop rating
laprating=[]
lap_rating = driver.find_elements_by_class_name("a-icon-alt")
for i in lap_rating[:10]:
    laprating.append(i.get_attribute('textContent'))

# code to extract laptop price
lapprice=[]
lap_price = driver.find_elements_by_xpath('//span[@class="a-price-whole"]')
for i in lap_price[:10]:
    lapprice.append(i.text)
    
# checking the length to get the data frame
print("Lengths of columns:", len(laptitle), len(laprating), len(lapprice))

# creating the data frame now
df = pd.DataFrame()
df['Laptop Title']=laptitle
df['Laptop Rating']=laprating
df['Laptop Price']=lapprice
df

Lengths of columns: 10 10 10

,Laptop Title,Laptop Rating,Laptop Price
0,HP 14s 11th Gen Intel Core i3- 8GB RAM/256GB S...,4.2 out of 5 stars,"39,990"
1,"HP Pavilion 14,11th Gen Intel Core i5 16GB RAM...",4.4 out of 5 stars,"67,490"
2,"ASUS TUF Gaming F15 (2021), 15.6-inch (39.62 c...",4.3 out of 5 stars,"1,43,990"
3,"ASUS TUF Gaming F15 (2021), 15.6-inch (39.62 c...",5.0 out of 5 stars,"1,48,990"
4,"ASUS TUF Gaming F15 (2021), 15.6"" (39.62 cms) ...",4.3 out of 5 stars,"1,54,890"
5,HP ZBOOK Power G8/ Intel core i9-11900H 8 Core...,1.0 out of 5 stars,"2,32,000"
6,(Renewed) HP Omen 15-dh0139TX Gaming Laptop (9...,4.3 out of 5 stars,"1,38,000"
7,Redmi Book Pro Intel Core i5 11th Gen 15.6-inc...,4.1 out of 5 stars,"47,990"
8,RedmiBook 15 e-Learning Edition Core i3 11th G...,3.4 out of 5 stars,"37,990"
9,HP ZBook Power G8/ Intel Core i9-11950H 2.5GHz...,4.3 out of 5 stars,"2,93,000"

# QUESTION:9

In [ ]:
Scraping data for first 10 job results for Data Scientist Designation in Noida.Scrapping following attributes:
1.company name
2.No. of days ago when job was posted
3.Rating of the company.

In [43]:
# getting the ambitionbox url on the web driver
url='https://www.ambitionbox.com'
driver.get(url)

In [44]:
# code to click job box  on the search button
search_btn = driver.find_element_by_xpath('/html/body/div[1]/nav/nav/a[6]')
search_btn.click()

In [45]:
#getting Data Scientist on search bar 
search_locn =driver.find_element_by_xpath('/html/body/div/div/div/div[2]/div[1]/div/div/div/div/span/input')
search_locn.send_keys("Data Scientist")

In [46]:
#code for clicking search button using absolute xpath function
search_btn=driver.find_element_by_xpath('/html/body/div/div/div/div[2]/div[1]/div/div/div/button')
search_btn.click()

In [47]:
# code to click on the location button to find Noida on search
location= driver.find_element_by_xpath('/html/body/div/div/div/div[2]/div[2]/div[1]/div/div/div/div[2]/div[1]/p')
location.click()

In [48]:
#getting Noida on search bar 
filter_locn =driver.find_element_by_xpath('/html/body/div/div/div/div[2]/div[2]/div[1]/div/div/div/div[2]/div[2]/div/div[2]/input')
filter_locn.send_keys("Noida")

In [49]:
location_button=driver.find_element_by_xpath('/html/body/div/div/div/div[2]/div[2]/div[1]/div/div/div/div[2]/div[2]/div/div[3]/div[1]/div[1]/div/label')
location_button.click()

In [ ]:
# get all the company names
names = driver.find_elements_by_xpath('//div[@class="info"]//p')
names

In [85]:
#Extracting the text from the tags
company=[]  #Empty list

#Scraping data for the first 10 job results
for i in names[:10]:
    company.append(i.text)
company

['NTT DATA GLOBAL DELIVERY SERVICES PRIVATE LIMITED',
 'HCL Technologies Limited',
 'Optum Global Solutions (India) Private Limited',
 'WSP CONSULTANTS INDIA PRIVATE LIMITED',
 'Microsoft India (R and D) Pvt Ltd',
 'Jubilant Foodworks Limited',
 'HCL Technologies',
 'Hanu Software Solutions Pvt Ltd',
 'Denave India Pvt Ltd.',
 'Tavant Technologies India Pvt. Ltd.']

In [88]:
#Extracting the tags having the no of days when job was posted
days=driver.find_elements_by_xpath('//span[1][@class="body-small-l"]')

In [90]:
#Extracting the text from the tags
no_of_days=[]  #Empty list

#Scraping data for the first 10 job results 
for i in days[:10]:
    no_of_days.append(i.text)
no_of_days

['6d ago',
 '7d ago',
 '17d ago',
 '8d ago',
 '18d ago',
 '5d ago',
 '22d ago',
 '7d ago',
 '1mon ago',
 '1mon ago']

In [ ]:
# Extracting the tags for rating of the companies
job_rating = driver.find_elements_by_xpath('//span[@class="body-small"]')
job_rating

In [97]:
#Extracting the text from the tags
rating = []
for i in job_rating:
    rating.append(i.text)
rating

['3.9', '3.8', '4.1', '4.2', '4.2', '3.9', '3.8', '3.7', '4.0', '4.0']

In [101]:
# checking the length to get the data frame
print("Lengths of columns:",len(company) ,len(no_of_days), len(rating))

Lengths of columns: 10 10 10

In [104]:
# creating the data frame 
df = pd.DataFrame()
df['Company Name']=company[:10]
df['Job posted Days']=no_of_days[:10]
df['Rating']=rating[:10]
df

                                        Company Name Job posted Days Rating
0  NTT DATA GLOBAL DELIVERY SERVICES PRIVATE LIMITED          6d ago    3.9
1                           HCL Technologies Limited          7d ago    3.8
2     Optum Global Solutions (India) Private Limited         17d ago    4.1
3              WSP CONSULTANTS INDIA PRIVATE LIMITED          8d ago    4.2
4                  Microsoft India (R and D) Pvt Ltd         18d ago    4.2
5                         Jubilant Foodworks Limited          5d ago    3.9
6                                   HCL Technologies         22d ago    3.8
7                    Hanu Software Solutions Pvt Ltd          7d ago    3.7
8                              Denave India Pvt Ltd.        1mon ago    4.0
9                Tavant Technologies India Pvt. Ltd.        1mon ago    4.0

# QUESTION:10

In [130]:
# getting the ambitionbox url on the web driver
url='https://www.ambitionbox.com'
driver.get(url)

In [131]:
#code to click salary box  
search_btn = driver.find_element_by_xpath('/html/body/div[1]/nav/nav/a[4]')
search_btn.click()

In [132]:
#input as Data scientist
search_job=driver.find_element_by_xpath('/html/body/div/div/div/main/section[1]/div[2]/div[1]/span/input')
search_job.send_keys("Data Scientist")

In [133]:
#code to click on the search button
search_btn1 = driver.find_element_by_xpath('/html/body/div/div/div/main/section[1]/div[2]/div[1]/span/div/div/div[1]')
search_btn1.click()

In [ ]:
#Extracting the tags having the company name
comp_name=driver.find_elements_by_xpath('//div[@class="company-info"]//a')
comp_name

In [135]:
#Extracting the text from the tags
company=[]  #Empty list

#Sraping data for the first 10 job results
for i in comp_name[:10]:
    company.append(i.text)
company

['Ab Inbev',
 'ZS',
 'Optum',
 'Fractal Analytics',
 'Tiger Analytics',
 'UnitedHealth',
 'Verizon',
 'Ganit Business Solutions',
 'Ericsson',
 'Deloitte']

In [ ]:
#Extracting the tags having the total salaries record
no_salaries=driver.find_elements_by_xpath('//div[@class="name"]//span')
no_salaries

In [141]:
#Extracting the text from the tags
no_of_salaries=[]  #Empty list

#Scraping data for the first 10 job results
for i in no_salaries[:10]:
    no_of_salaries.append(i.text)
no_of_salaries

['based on 28 salaries',
 'based on 15 salaries',
 'based on 25 salaries',
 'based on 77 salaries',
 'based on 33 salaries',
 'based on 52 salaries',
 'based on 14 salaries',
 'based on 13 salaries',
 'based on 43 salaries',
 'based on 57 salaries']

In [ ]:
#Extracting the tags for average salary
avg_sal=driver.find_elements_by_xpath("//p[@class='averageCtc']")
avg_sal

In [143]:
#Extracting the text from the tags
avg_salary=[]  #Empty list

#Scraping data for the first 10 job results
for i in avg_sal[:10]:
    avg_salary.append(i.text.replace('\n',''))
avg_salary

['₹ 20.3L',
 '₹ 15.3L',
 '₹ 15.1L',
 '₹ 15.1L',
 '₹ 14.4L',
 '₹ 13.9L',
 '₹ 12.7L',
 '₹ 12.4L',
 '₹ 11.9L',
 '₹ 11.7L']

In [ ]:
#Extracting the tags for minimum salary
min_sal=driver.find_elements_by_xpath("//div[1][@class='value body-medium']")
min_sal

In [151]:
#Extracting the text from the tags
min_salary=[]  #Empty list

#Scraping data for the first 10 min_salary results
for i in min_sal[:10]:
    min_salary.append(i.text)
min_salary

['₹ 15.0L',
 '₹ 9.5L',
 '₹ 11.0L',
 '₹ 9.5L',
 '₹ 8.3L',
 '₹ 8.3L',
 '₹ 10.0L',
 '₹ 8.5L',
 '₹ 5.8L',
 '₹ 6.9L']

In [ ]:
#Extracting the tags for minimum salary
max_sal=driver.find_elements_by_xpath("//div[2][@class='value body-medium']")
max_sal

In [154]:
#Extracting the text from the tags
max_salary=[]  #Empty list

#Scraping data for the first 10 max_salary results
for i in max_sal[:10]:
    max_salary.append(i.text)
max_salary

['₹ 25.5L',
 '₹ 20.0L',
 '₹ 21.3L',
 '₹ 22.0L',
 '₹ 20.0L',
 '₹ 20.5L',
 '₹ 21.0L',
 '₹ 15.0L',
 '₹ 24.0L',
 '₹ 23.4L']

In [ ]:
#Extracting the tags for experience
exp=driver.find_elements_by_xpath("//div[@class='salaries sbold-list-header']")
exp

In [165]:
#Extracting the text from the tags
experience=[]  #Empty list

#Scraping data for the first 10 max_salary results
for i in exp[:10]:
    experience.append(i.text.split('\n')[2])
experience

['3-4 yrs exp',
 '2 yrs exp',
 '3-4 yrs exp',
 '2-4 yrs exp',
 '3-4 yrs exp',
 '2-4 yrs exp',
 '4 yrs exp',
 '4 yrs exp',
 '3-4 yrs exp',
 '2-4 yrs exp']

In [169]:
# checking the length to get the data frame
print("Lengths of columns:",len(company) ,len(no_of_salaries),len(avg_salary), len(min_salary),len(max_salary),len(experience))

Lengths of columns: 10 10 10 10 10 10

In [170]:
# creating the data frame 
df = pd.DataFrame()
df['Company Name']=company
df['Number of Salary Records']=no_of_salaries
df['Average Salary']=avg_salary
df['Minimum Salary']=min_salary
df['Maximum Salary']=max_salary
df['Experience']=experience
df

,Company Name,Number of Salary Records,Average Salary,Minimum Salary,Maximum Salary,Experience
0,Ab Inbev,based on 28 salaries,₹ 20.3L,₹ 15.0L,₹ 25.5L,3-4 yrs exp
1,ZS,based on 15 salaries,₹ 15.3L,₹ 9.5L,₹ 20.0L,2 yrs exp
2,Optum,based on 25 salaries,₹ 15.1L,₹ 11.0L,₹ 21.3L,3-4 yrs exp
3,Fractal Analytics,based on 77 salaries,₹ 15.1L,₹ 9.5L,₹ 22.0L,2-4 yrs exp
4,Tiger Analytics,based on 33 salaries,₹ 14.4L,₹ 8.3L,₹ 20.0L,3-4 yrs exp
5,UnitedHealth,based on 52 salaries,₹ 13.9L,₹ 8.3L,₹ 20.5L,2-4 yrs exp
6,Verizon,based on 14 salaries,₹ 12.7L,₹ 10.0L,₹ 21.0L,4 yrs exp
7,Ganit Business Solutions,based on 13 salaries,₹ 12.4L,₹ 8.5L,₹ 15.0L,4 yrs exp
8,Ericsson,based on 43 salaries,₹ 11.9L,₹ 5.8L,₹ 24.0L,3-4 yrs exp
9,Deloitte,based on 57 salaries,₹ 11.7L,₹ 6.9L,₹ 23.4L,2-4 yrs exp